In [1]:
import pandas as pd

**Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.** \
**A1.**

In [2]:
# to create a pandas Series 

ds = pd.Series([4,8,15,16,23,42])

# to print this series 
ds      # or print(ds)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [3]:
# to check if this is a series
type(ds)

pandas.core.series.Series


**Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.** \
**A2.**

In [4]:
# creating a varible of list type contining 10 random elements 
lst_var = [3,4,5,9,8,'Sumit',6.0,'Hello',888,999]
type(lst_var)

list

In [5]:
# now creating a series varible using pandas.Series function
lv_series = pd.Series(lst_var)   # or pd.Series(lst_var)

In [6]:
print(lv_series)

0        3
1        4
2        5
3        9
4        8
5    Sumit
6      6.0
7    Hello
8      888
9      999
dtype: object

In [7]:
type(lv_series)

pandas.core.series.Series

**Q3. Create a Pandas DataFrame that contains the following data:**
| name   | age | gender |
|--------|-----|--------|
| Alice  | 25  | female |
| Bob    | 30  | male   |
| Claire | 27  | female | 




**Then, print the DataFrame.** 

**A3.**

In [8]:
# to create a pandas dataframe lets make a dictionary first

data = {"Name":['Alice',"Bob", "Claire",],
        "Age": [25,30,27,],
        "Gender" : ['female','male','female']}

# Now we can pass dict into a dataframe name df

df = pd.DataFrame(data)

In [9]:
df # or print(df)

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female

In [10]:
type(df)

pandas.core.frame.DataFrame

**Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.** \
**A4.**

**In Pandas, a DataFrame is a two-dimensional, tabular data structure with labeled axes (rows and columns). 
\
It is similar to a spreadsheet or SQL table, where data can be stored in rows and columns. \
Each column in a DataFrame is a Pandas Series.
\
A Pandas Series, on the other hand, is a one-dimensional labeled array capable of holding any data type.\
It is essentially a single column of a DataFrame. 
\
A DataFrame can be thought of as a collection of Series, where each Series represents a column.
\
An example to describe the difference between a DataFrame and a Series:**

In [11]:
# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Claire'],
        'Age': [25, 30, 27],
        'Gender': ['female', 'male', 'female']}

df = pd.DataFrame(data)

# Displaying the DataFrame
print("DataFrame:")
print(df)
print("\n")

# Extracting a Series from the DataFrame
name_series = df['Name']

# Displaying the Series
print("Series (name column):")
print(name_series)

DataFrame:
     Name  Age  Gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female


Series (name column):
0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

**Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Canyou give an example of when you might use one of these functions?**
\
**A5.**

**Pandas provides variety of functions to manipulate data in DataFrame:
\
below are some of them.**

In [12]:
# lets add more data to dataframe we created earlier
data2 = {'Name': ['Sara', 'Sumit', 'Rahul', 'Mark'],
        'Age': [25, 30, 27, 29],
        'Gender': ['female', 'male', 'male', 'male']
        }
df1= pd.DataFrame(data2)

# concat df1 to df

df = pd.concat([df,df1], ignore_index = True)
df

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female
3    Sara   25  female
4   Sumit   30    male
5   Rahul   27    male
6    Mark   29    male

# head()

In [13]:
# displays the first five rows of dataframe
df.head(3)

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female

# tail()

In [14]:
#displays the last five rows of dataframe
df.tail(3)

    Name  Age Gender
4  Sumit   30   male
5  Rahul   27   male
6   Mark   29   male

# describe()

In [15]:
# to display statistics of dataframe
df.describe()

             Age
count   7.000000
mean   27.571429
std     2.149197
min    25.000000
25%    26.000000
50%    27.000000
75%    29.500000
max    30.000000

# info()

In [16]:
# to display information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

**Q6. Which of the following is mutable in nature \
Series, DataFrame, Panel?**
\
**A6.**
\
In Pandas:

- **Series** is mutable.
- **DataFrame** is mutable.
- **Panel** is mutable, but as of Pandas version 0.25.0, Panel is deprecated. The recommended way to represent three-dimensional data is using a MultiIndex DataFrame.
\
So, both Series and DataFrame are mutable in nature, while Panel is deprecated, and it is recommended to use MultiIndex DataFrames for similar functionality.**

**Q7. Create a DataFrame using multiple Series. Explain with an example.**
\
**A7.**
 - We can create a DataFrame using multiple Series by combining them into a dictionary and then converting that dictionary into a DataFrame.

In [17]:
# creating multiple series variables

ds1 = pd.Series(['Monday','Tuesday','Wednesday','Thursday','Friday'])
ds2 = pd.Series([1,3,3,2,5])
ds3 = pd.Series(['Ms. Ellie','Mr.John','Mrs. Sheela'])

# now creating a dict of them
data = {"Day":ds1,"Class":ds2,"Teacher":ds3}

In [18]:
# now we can create a DataFrame from data dictionary
df2 = pd.DataFrame(data)
df2

         Day  Class      Teacher
0     Monday      1    Ms. Ellie
1    Tuesday      3      Mr.John
2  Wednesday      3  Mrs. Sheela
3   Thursday      2          NaN
4     Friday      5          NaN

# above two values in `Teacher` column are missing becuase we didn't enter into ds3 so thats why they are null values